Este é um código prático do que eu aprendi durante as aulas de Numpy e Pandas

In [31]:
import pandas as pd
import numpy as np

Importação de um dataframe de bancos falidos dos estados unidos pelo html

In [61]:
tabela = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list?combine=&items_per_page=All')
df = tabela[0]

Numero de Bancos fechados por estado e organizados do maior para o menor

In [63]:
df.groupby('State')['Bank Name'].count().sort_values(ascending=False)

State
Georgia           93
Florida           76
Illinois          70
California        43
Minnesota         23
Washington        19
Missouri          16
Arizona           16
Michigan          14
Texas             13
Kansas            12
Nevada            12
Pennsylvania      11
Wisconsin         11
Colorado          10
Maryland          10
South Carolina    10
Ohio               9
Utah               8
New Jersey         8
Oklahoma           8
Alabama            7
North Carolina     7
Tennessee          7
Oregon             6
New York           6
Virginia           5
Puerto Rico        4
Nebraska           4
Louisiana          4
Arkansas           4
New Mexico         3
Kentucky           3
Iowa               3
Indiana            3
Mississippi        2
Idaho              2
Connecticut        2
West Virginia      2
New Hampshire      1
Massachusetts      1
South Dakota       1
Hawaii             1
Wyoming            1
Name: Bank Name, dtype: int64

Data de fechamento dos bancos mais recentes de cada estado

In [89]:
df.groupby('State')['Closing Date'].min()

State
Alabama              April 15, 2011
Arizona               April 5, 2013
Arkansas          December 17, 2010
California           April 16, 2010
Colorado             April 10, 2009
Connecticut           June 26, 2002
Florida              April 16, 2010
Georgia              April 15, 2011
Hawaii             October 13, 2000
Idaho                April 24, 2009
Illinois             April 23, 2010
Indiana           February 10, 2012
Iowa              November 18, 2011
Kansas              August 12, 2011
Kentucky             April 19, 2013
Louisiana            April 28, 2017
Maryland             April 27, 2012
Massachusetts        April 16, 2010
Michigan             April 16, 2010
Minnesota            April 15, 2011
Mississippi          April 15, 2011
Missouri             April 17, 2009
Nebraska          February 13, 2009
Nevada               April 17, 2009
New Hampshire      February 2, 2001
New Jersey           April 20, 2012
New Mexico         January 22, 2010
New York              July 24, 2009
North Carolina       April 10, 2009
Ohio               December 4, 2009
Oklahoma           January 24, 2014
Oregon               August 7, 2009
Pennsylvania         April 26, 2024
Puerto Rico          April 30, 2010
South Carolina       April 25, 2014
South Dakota          July 17, 2009
Tennessee            April 29, 2016
Texas               August 21, 2009
Utah               January 15, 2010
Virginia            August 20, 2010
Washington           April 16, 2010
West Virginia         April 3, 2020
Wisconsin            August 9, 2013
Wyoming               July 10, 2009
Name: Closing Date, dtype: object

As 10 utlimas linhas do dataframe

In [79]:
df.tail(10)

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
561,Net First National Bank,Boca Raton,Florida,26652,Bank Leumi USA,"March 1, 2002",4654
562,"NextBank, NA",Phoenix,Arizona,22314,No Acquirer,"February 7, 2002",4653
563,Oakwood Deposit Bank Co.,Oakwood,Ohio,8966,The State Bank & Trust Company,"February 1, 2002",4652
564,Bank of Sierra Blanca,Sierra Blanca,Texas,22002,The Security State Bank of Pecos,"January 18, 2002",4651
565,"Hamilton Bank, N.A.",Miami,Florida,24382,Israel Discount Bank of New York,"January 11, 2002",4650
566,Sinclair National Bank,Gravette,Arkansas,34248,Delta Trust & Bank,"September 7, 2001",4649
567,Malta National Bank,Malta,Ohio,6629,North Valley Bank,"May 3, 2001",4648
568,First Alliance Bank & Trust Co.,Manchester,New Hampshire,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
569,The National State Bank of Metropolis,Metropolis,Illinois,3815,Banterra Bank of Marion,"December 14, 2000",4646
570,Bank of Honolulu,Honolulu,Hawaii,21029,Bank of the Orient,"October 13, 2000",4645

Quais instituições mais adquiriram os bancos

In [95]:
df['Aquiring Institution'].value_counts().head(10)

Aquiring Institution
No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Community & Southern Bank               8
Stearns Bank, N.A.                      7
Bank of the Ozarks                      7
Centennial Bank                         6
MB Financial Bank, N.A.                 6
Name: count, dtype: int64